tutorials/cylinder2D/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          60;
        startFace       59;
    }
    back
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          60;
        startFace       119;
    }
    cylinderback
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          2;
        startFace       179;
    }
    wallFilmFaces_top
    {
        type            patch;
        nFaces          60;
        startFace       181;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          60;
        startFace       241;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
60
(
(-1.387778781e-17 0 -4.33680869e-19)
(0 -8.67361738e-19 0)
(-1.387778781e-17 -1.734723476e-18 0)
(0 -1.734723476e-18 0)
(-1.387778781e-17 8.67361738e-19 0)
(1.387778781e-17 0 -3.469446952e-18)
(-1.387778781e-17 0 0)
(-1.387778781e-17 1.734723476e-18 0)
...
)
;
    }
)

// ************************************************************************* //
