tutorials/cylinder2D/constant/iceFoamCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         no;
    transient       yes;
    cellValueSourceCorrection no;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              270;
    Cp0             4187;

    constantVolume  false;
}

subModels
{
    particleForces
    {
        SphereChooseCdDrag
        {
            CdType Putnam; //Putnam; Habashi; Prihodko; Gent; Ochkov; ShillerNeyman;
        }
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            reactingMultiphaseLookupTableInjection;
            inputFile       "parcelInjectionProperties";
            massTotal       0.186;
            parcelBasisType mass;
            SOI             0;
            inputFile       "parcelInjectionProperties";
            duration        1000.0;
            parcelsPerSecond 1860;
            randomise       true;
//            sizeDistribution
//	    {
//		type	   RozinRammler;
//		RozinRammlerDistribution
//		{
//		    minValue	3e-6;
//		    maxValue	300e-6;
//		    d		30e-6;
//		    n		2.5;
//		}
//	    }
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel Clift; //Clift; Feng; RanzMarshall; Whitaker; none;

    CliftCoeffs //FengCoeffs RanzMarshallCoeffs WhitakerCoeffs
    {
	BirdCorrection  false;
    }

    compositionModel singleMixtureFraction;

    phaseChangeModel none;

    devolatilisationModel none;

    surfaceReactionModel none;

    stochasticCollisionModel none;

    surfaceFilmModel thermoSurfaceFilm;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
            }
            liquid
            {
                H2O         1;
            }
            solid
            {
            }
        );
        YGasTot0        0;
        YLiquidTot0     1;
        YSolidTot0      0;
    }

    thermoSurfaceFilmCoeffs
    {
        interactionType absorb;
    }
}


cloudFunctions
{}


// ************************************************************************* //
