tutorials/cylinder2D/0/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/wallFilmRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallFilmFaces_top
    {
        type            slip;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    top
    {
        type            Slip;
    }
    cylinderfront
    {
        type            noSlip;
    }
    bottom
    {
        type            Slip;
    }
    outlet
    {
        type            Slip;
    }
    cylinderback
    {
        type            noSlip;
    }

}


// ************************************************************************* //
